import { Component, OnInit } from '@angular/core';

@Component({
    selector: 'app-index',
    templateUrl: './index.component.html',
    styleUrls: ['./index.component.less']
})
export class IndexComponent implements OnInit {
    data1 = [
        '我国成功发射两颗北斗三号全球组网卫星',
        '我国在西昌卫星发射中心15日成功发射两嘎嘎嘎嘎嘎嘎',
        '中国“一箭双星”成功发射两颗北斗全球导喵喵喵喵喵喵喵喵',
        '人造月亮”拟于2020年西昌发射升空：汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪',
        '我国成功发射两颗北斗三号全球组网卫星',
        '我国成功发射两颗北斗三号全球组网卫星',
        '我国在西昌卫星发射中心15日成功发射两嘎嘎嘎嘎嘎嘎',
        '中国“一箭双星”成功发射两颗北斗全球导喵喵喵喵喵喵喵喵',
        '人造月亮”拟于2020年西昌发射升空：汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪汪',
        '我国成功发射两颗北斗三号全球组网卫星',
    ];
    date = '';
    dataSet = [
        {
            key: '1',
            name: '卫星跟踪系统故障',
            age: '质量问题',
            address: '卫星无线跟踪系统移动交换机',
            gongyingshang: '成都昊城通讯器材贸易有限公司',
            time: '2018-09-20',
            bumenL: '生产部',
        },
    ];
    constructor(

    ) { }

    ngOnInit() {

    }
}
